## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
waf.tf
```
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 12 to add, 18 to change, 12 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                       NAME                                       |
|----------|----------------------------------------------------------------------------------|
| recreate | `aws_s3_bucket.maintenance_mode`                                                 |
|          | `aws_s3_bucket_acl.maintenance_mode`                                             |
|          | `aws_s3_bucket_policy.allow_cloudfront_to_access_static_website_in_s3`           |
|          | `aws_s3_bucket_public_access_block.maintenance_mode`                             |
|          | `aws_s3_bucket_server_side_encryption_configuration.maintenance_mode`            |
| add      | `aws_s3_bucket_ownership_controls.maintenance_mode`                              |
|          | `aws_s3_bucket_website_configuration.maintenance_mode`                           |
|          | `aws_s3_object.maintenance_static_page_css_files[&quot;style.css&quot;]`                   |
|          | `aws_s3_object.maintenance_static_page_html_files[&quot;index-fr.html&quot;]`              |
|          | `aws_s3_object.maintenance_static_page_html_files[&quot;index.html&quot;]`                 |
|          | `aws_s3_object.maintenance_static_page_ico_files[&quot;favicon.ico&quot;]`                 |
|          | `aws_s3_object.maintenance_static_page_svg_files[&quot;site-unavailable.svg&quot;]`        |
| delete   | `aws_s3_bucket.firehose_waf_logs`                                                |
|          | `aws_s3_bucket_object.maintenance_static_page_css_files[&quot;style.css&quot;]`            |
|          | `aws_s3_bucket_object.maintenance_static_page_html_files[&quot;index-fr.html&quot;]`       |
|          | `aws_s3_bucket_object.maintenance_static_page_html_files[&quot;index.html&quot;]`          |
|          | `aws_s3_bucket_object.maintenance_static_page_ico_files[&quot;favicon.ico&quot;]`          |
|          | `aws_s3_bucket_object.maintenance_static_page_svg_files[&quot;site-unavailable.svg&quot;]` |
|          | `aws_s3_bucket_public_access_block.firehose_waf_logs`                            |
| update   | `aws_acm_certificate.form_viewer`                                                |
|          | `aws_acm_certificate.form_viewer_maintenance_mode`                               |
|          | `aws_cloudfront_distribution.maintenance_mode`                                   |
|          | `aws_iam_role.firehose_waf_logs`                                                 |
|          | `aws_kinesis_firehose_delivery_stream.firehose_waf_logs`                         |
|          | `aws_lb.form_viewer`                                                             |
|          | `aws_lb_listener.form_viewer_http`                                               |
|          | `aws_lb_listener.form_viewer_https`                                              |
|          | `aws_lb_target_group.form_viewer_1`                                              |
|          | `aws_lb_target_group.form_viewer_2`                                              |
|          | `aws_shield_protection.alb`                                                      |
|          | `aws_shield_protection.route53_hosted_zone[0]`                                   |
|          | `aws_wafv2_regex_pattern_set.cognito_login_paths`                                |
|          | `aws_wafv2_regex_pattern_set.forms_base_url`                                     |
|          | `aws_wafv2_regex_pattern_set.valid_app_uri_paths`                                |
|          | `aws_wafv2_regex_pattern_set.valid_maintenance_mode_uri_paths`                   |
|          | `aws_wafv2_web_acl.forms_acl`                                                    |
|          | `aws_wafv2_web_acl.forms_maintenance_mode_acl`                                   |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/forms-terraform/actions/runs/7401341380).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.allow_cloudfront_to_access_static_website_in_s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_cloudfront_to_access_static_website_in_s3" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2PGE1KRH6OS33",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_acm_certificate.form_viewer will be updated in-place
  ~ resource "aws_acm_certificate" "form_viewer" {
        id                        = "arn:aws:acm:ca-central-1:687401027353:certificate/e0d9fd55-738a-4ab6-bfda-1ecacec99b06"
      ~ tags                      = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_acm_certificate.form_viewer_maintenance_mode will be updated in-place
  ~ resource "aws_acm_certificate" "form_viewer_maintenance_mode" {
        id                        = "arn:aws:acm:us-east-1:687401027353:certificate/477e3f0d-675e-4c4b-822e-866d482d4928"
      ~ tags                      = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudfront_distribution.maintenance_mode will be updated in-place
  ~ resource "aws_cloudfront_distribution" "maintenance_mode" {
        id                             = "E2NX6QAIR13JTM"
      ~ tags                           = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (21 unchanged attributes hidden)

      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "gc-forms-application-maintenance-page.s3.ca-central-1.amazonaws.com" -> null
          - origin_id           = "MaintenanceMode" -> null

          - s3_origin_config {
              - origin_access_identity = "origin-access-identity/cloudfront/E2PGE1KRH6OS33" -> null
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "MaintenanceMode"

          + s3_origin_config {
              + origin_access_identity = "origin-access-identity/cloudfront/E2PGE1KRH6OS33"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_iam_role.firehose_waf_logs will be updated in-place
  ~ resource "aws_iam_role" "firehose_waf_logs" {
        id                    = "firehose_waf_logs"
        name                  = "firehose_waf_logs"
      ~ tags                  = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_kinesis_firehose_delivery_stream.firehose_waf_logs will be updated in-place
  ~ resource "aws_kinesis_firehose_delivery_stream" "firehose_waf_logs" {
        id             = "arn:aws:firehose:ca-central-1:687401027353:deliverystream/aws-waf-logs-forms"
        name           = "aws-waf-logs-forms"
      ~ tags           = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lb.form_viewer will be updated in-place
  ~ resource "aws_lb" "form_viewer" {
        id                                          = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:loadbalancer/app/form-viewer/5e6bc2d9ab810b68"
        name                                        = "form-viewer"
      ~ tags                                        = {
          - "CostCentre" = "forms-platform-staging" -> null
            "Name"       = "form_viewer"
          - "Terraform"  = "true" -> null
        }
        # (22 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lb_listener.form_viewer_http will be updated in-place
  ~ resource "aws_lb_listener" "form_viewer_http" {
        id                = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:listener/app/form-viewer/5e6bc2d9ab810b68/d6a2d118e3e0e216"
      ~ tags              = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lb_listener.form_viewer_https will be updated in-place
  ~ resource "aws_lb_listener" "form_viewer_https" {
        id                = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:listener/app/form-viewer/5e6bc2d9ab810b68/028e8eeeed9c3a34"
      ~ tags              = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lb_target_group.form_viewer_1 will be updated in-place
  ~ resource "aws_lb_target_group" "form_viewer_1" {
        id                                 = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:targetgroup/form-viewer/decb39cad732d3d4"
        name                               = "form-viewer"
      ~ tags                               = {
          - "CostCentre" = "forms-platform-staging" -> null
            "Name"       = "form_viewer_1"
          - "Terraform"  = "true" -> null
        }
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lb_target_group.form_viewer_2 will be updated in-place
  ~ resource "aws_lb_target_group" "form_viewer_2" {
        id                                 = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:targetgroup/form-viewer-2/9cd62fabd5d34460"
        name                               = "form-viewer-2"
      ~ tags                               = {
          - "CostCentre" = "forms-platform-staging" -> null
            "Name"       = "form_viewer_2"
          - "Terraform"  = "true" -> null
        }
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket.firehose_waf_logs will be destroyed
  # (because aws_s3_bucket.firehose_waf_logs is not in configuration)
  - resource "aws_s3_bucket" "firehose_waf_logs" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::forms-staging-terraform-waf-logs" -> null
      - bucket                      = "forms-staging-terraform-waf-logs" -> null
      - bucket_domain_name          = "forms-staging-terraform-waf-logs.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "forms-staging-terraform-waf-logs.s3.ca-central-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1QDHH18159H29" -> null
      - id                          = "forms-staging-terraform-waf-logs" -> null
      - object_lock_enabled         = false -> null
      - region                      = "ca-central-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                    = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null

      - grant {
          - id          = "8ee828b5522b38b6797b8f886ed0b30f039d4eaa7ea331fa60669a6e0352d7e5" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "tf-s3-lifecycle-20211112190024126200000001" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 90 -> null
              - expired_object_delete_marker = false -> null
            }
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.maintenance_mode must be replaced
-/+ resource "aws_s3_bucket" "maintenance_mode" {
      + acceleration_status         = (known after apply)
      ~ acl                         = "private" -> (known after apply)
      ~ arn                         = "arn:aws:s3:::gc-forms-application-maintenance-page" -> (known after apply)
      ~ bucket                      = "gc-forms-application-maintenance-page" -> "gc-forms-staging-application-maintenance-page" # forces replacement
      ~ bucket_domain_name          = "gc-forms-application-maintenance-page.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "gc-forms-application-maintenance-page.s3.ca-central-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z1QDHH18159H29" -> (known after apply)
      ~ id                          = "gc-forms-application-maintenance-page" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2PGE1KRH6OS33"
                        }
                      - Resource  = "arn:aws:s3:::gc-forms-application-maintenance-page/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "ca-central-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      - grant {
          - id          = "8ee828b5522b38b6797b8f886ed0b30f039d4eaa7ea331fa60669a6e0352d7e5" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket_acl.maintenance_mode must be replaced
-/+ resource "aws_s3_bucket_acl" "maintenance_mode" {
      ~ bucket = "gc-forms-application-maintenance-page" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "gc-forms-application-maintenance-page,private" -> (known after apply)
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id   = "8ee828b5522b38b6797b8f886ed0b30f039d4eaa7ea331fa60669a6e0352d7e5" -> null
                  - type = "CanonicalUser" -> null
                }
            }
          - owner {
              - id = "8ee828b5522b38b6797b8f886ed0b30f039d4eaa7ea331fa60669a6e0352d7e5" -> null
            }
        }
    }

  # aws_s3_bucket_object.maintenance_static_page_css_files["style.css"] will be destroyed
  # (because aws_s3_bucket_object.maintenance_static_page_css_files is not in configuration)
  - resource "aws_s3_bucket_object" "maintenance_static_page_css_files" {
      - acl                    = "private" -> null
      - bucket                 = "gc-forms-application-maintenance-page" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/css" -> null
      - etag                   = "92fa1c75f720e83330756f94b06aa8bf" -> null
      - force_destroy          = false -> null
      - id                     = "style.css" -> null
      - key                    = "style.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./static_website/style.css" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_object.maintenance_static_page_html_files["index-fr.html"] will be destroyed
  # (because aws_s3_bucket_object.maintenance_static_page_html_files is not in configuration)
  - resource "aws_s3_bucket_object" "maintenance_static_page_html_files" {
      - acl                    = "private" -> null
      - bucket                 = "gc-forms-application-maintenance-page" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/html" -> null
      - etag                   = "5c195ef016b9e898437a543aba2301ac" -> null
      - force_destroy          = false -> null
      - id                     = "index-fr.html" -> null
      - key                    = "index-fr.html" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./static_website/index-fr.html" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_object.maintenance_static_page_html_files["index.html"] will be destroyed
  # (because aws_s3_bucket_object.maintenance_static_page_html_files is not in configuration)
  - resource "aws_s3_bucket_object" "maintenance_static_page_html_files" {
      - acl                    = "private" -> null
      - bucket                 = "gc-forms-application-maintenance-page" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/html" -> null
      - etag                   = "f15e6aa2fd75c9b6b97d93d2b1fedfbd" -> null
      - force_destroy          = false -> null
      - id                     = "index.html" -> null
      - key                    = "index.html" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./static_website/index.html" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_object.maintenance_static_page_ico_files["favicon.ico"] will be destroyed
  # (because aws_s3_bucket_object.maintenance_static_page_ico_files is not in configuration)
  - resource "aws_s3_bucket_object" "maintenance_static_page_ico_files" {
      - acl                    = "private" -> null
      - bucket                 = "gc-forms-application-maintenance-page" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "image/png" -> null
      - etag                   = "58bd7822fbbd5642104beae2b25a1b5b" -> null
      - force_destroy          = false -> null
      - id                     = "favicon.ico" -> null
      - key                    = "favicon.ico" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./static_website/favicon.ico" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_object.maintenance_static_page_svg_files["site-unavailable.svg"] will be destroyed
  # (because aws_s3_bucket_object.maintenance_static_page_svg_files is not in configuration)
  - resource "aws_s3_bucket_object" "maintenance_static_page_svg_files" {
      - acl                    = "private" -> null
      - bucket                 = "gc-forms-application-maintenance-page" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "image/svg+xml" -> null
      - etag                   = "1d263a8e324e88ea09c9b630de277c45" -> null
      - force_destroy          = false -> null
      - id                     = "site-unavailable.svg" -> null
      - key                    = "site-unavailable.svg" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./static_website/site-unavailable.svg" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_ownership_controls.maintenance_mode will be created
  + resource "aws_s3_bucket_ownership_controls" "maintenance_mode" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_policy.allow_cloudfront_to_access_static_website_in_s3 must be replaced
-/+ resource "aws_s3_bucket_policy" "allow_cloudfront_to_access_static_website_in_s3" {
      ~ bucket = "gc-forms-application-maintenance-page" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "gc-forms-application-maintenance-page" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2PGE1KRH6OS33"
                        }
                      - Resource  = "arn:aws:s3:::gc-forms-application-maintenance-page/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # aws_s3_bucket_public_access_block.firehose_waf_logs will be destroyed
  # (because aws_s3_bucket_public_access_block.firehose_waf_logs is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "firehose_waf_logs" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "forms-staging-terraform-waf-logs" -> null
      - id                      = "forms-staging-terraform-waf-logs" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # aws_s3_bucket_public_access_block.maintenance_mode must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "maintenance_mode" {
      ~ bucket                  = "gc-forms-application-maintenance-page" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "gc-forms-application-maintenance-page" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket_server_side_encryption_configuration.maintenance_mode must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "maintenance_mode" {
      ~ bucket = "gc-forms-application-maintenance-page" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "gc-forms-application-maintenance-page" -> (known after apply)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_website_configuration.maintenance_mode will be created
  + resource "aws_s3_bucket_website_configuration" "maintenance_mode" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }
    }

  # aws_s3_object.maintenance_static_page_css_files["style.css"] will be created
  + resource "aws_s3_object" "maintenance_static_page_css_files" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css"
      + etag                   = "92fa1c75f720e83330756f94b06aa8bf"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "style.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/style.css"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.maintenance_static_page_html_files["index-fr.html"] will be created
  + resource "aws_s3_object" "maintenance_static_page_html_files" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = "5c195ef016b9e898437a543aba2301ac"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index-fr.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/index-fr.html"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.maintenance_static_page_html_files["index.html"] will be created
  + resource "aws_s3_object" "maintenance_static_page_html_files" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = "f15e6aa2fd75c9b6b97d93d2b1fedfbd"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/index.html"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.maintenance_static_page_ico_files["favicon.ico"] will be created
  + resource "aws_s3_object" "maintenance_static_page_ico_files" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "58bd7822fbbd5642104beae2b25a1b5b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon.ico"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/favicon.ico"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.maintenance_static_page_svg_files["site-unavailable.svg"] will be created
  + resource "aws_s3_object" "maintenance_static_page_svg_files" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "1d263a8e324e88ea09c9b630de277c45"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "site-unavailable.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/site-unavailable.svg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_shield_protection.alb will be updated in-place
  ~ resource "aws_shield_protection" "alb" {
        id           = "0cca3ef1-8edc-4180-8740-febba699a5b2"
        name         = "LoadBalancer"
      ~ tags         = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (3 unchanged attributes hidden)
    }

  # aws_shield_protection.route53_hosted_zone[0] will be updated in-place
  ~ resource "aws_shield_protection" "route53_hosted_zone" {
        id           = "84aef9e9-74ea-4dfc-bc40-ff3f3ca3700c"
        name         = "Route53HostedZone"
      ~ tags         = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (3 unchanged attributes hidden)
    }

  # aws_wafv2_regex_pattern_set.cognito_login_paths will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "cognito_login_paths" {
        id          = "06fb5625-dab4-4133-ab2d-2e618dd01c47"
        name        = "cognito_login_paths"
        tags        = {}
      ~ tags_all    = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_wafv2_regex_pattern_set.forms_base_url will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "forms_base_url" {
        id          = "92da9411-8b49-4c9e-b80f-ac7ea482f3d1"
        name        = "forms_base_url"
        tags        = {}
      ~ tags_all    = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_wafv2_regex_pattern_set.valid_app_uri_paths will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "valid_app_uri_paths" {
        id          = "2020c3bc-eb87-45f3-8ee7-99cd707612e7"
        name        = "valid_app_uri_paths"
        tags        = {}
      ~ tags_all    = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_wafv2_regex_pattern_set.valid_maintenance_mode_uri_paths will be...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.form_viewer"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.form_viewer_maintenance_mode"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudfront_distribution.maintenance_mode"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.firehose_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.firehose_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.form_viewer"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.form_viewer_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.form_viewer_https"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.form_viewer_1"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.form_viewer_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.maintenance_mode"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_css_files[\"style.css\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_html_files[\"index-fr.html\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_html_files[\"index.html\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_ico_files[\"favicon.ico\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_svg_files[\"site-unavailable.svg\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.alb"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.route53_hosted_zone[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.cognito_login_paths"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.forms_base_url"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
